#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.fastly_tls_configuration.configuration: Reading...
data.fastly_tls_configuration.configuration: Read complete after 0s [id=MAaRB6MO1GLDYzPm9W3miQ]
fastly_tls_subscription.subscription: Refreshing state... [id=VGah8NFhdAq1z7rAO9B4jQ]
data.aws_route53_zone.zone: Reading...
data.aws_route53_zone.zone: Read complete after 0s [id=Z032720523R36CX8M8EQU]
aws_route53_record.domain_validation[0]: Refreshing state... [id=Z032720523R36CX8M8EQU__acme-challenge.stage.hkakehas.tokyo_CNAME]
fastly_tls_subscription_validation.validation: Refreshing state... [id=VGah8NFhdAq1z7rAO9B4jQ]
aws_route53_record.records["stage.hkakehas.tokyo"]: Refreshing state... [id=Z032720523R36CX8M8EQU_stage.hkakehas.tokyo_CNAME]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # fastly_tls_subscription.subscription has changed
  ~ resource "fastly_tls_subscription" "subscription" {
        id                      = "VGah8NFhdAq1z7rAO9B4jQ"
      ~ updated_at              = "2024-03-04T10:42:20Z" -> "2024-03-04T10:45:18Z"
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.domain_validation[0] must be replaced
-/+ resource "aws_route53_record" "domain_validation" {
      ~ fqdn                             = "_acme-challenge.stage.hkakehas.tokyo" -> (known after apply)
      ~ id                               = "Z032720523R36CX8M8EQU__acme-challenge.stage.hkakehas.tokyo_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_acme-challenge.stage.hkakehas.tokyo" # forces replacement -> (known after apply)
      ~ records                          = [
          - "tmmgyi0x887qmypzqv.fastly-validations.com",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.domain_validation[1] will be created
  + resource "aws_route53_record" "domain_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z032720523R36CX8M8EQU"
    }

  # aws_route53_record.records["prod.hkakehas.tokyo"] will be created
  + resource "aws_route53_record" "records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "prod.hkakehas.tokyo"
      + records         = [
          + "t.sni.global.fastly.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z032720523R36CX8M8EQU"
    }

  # fastly_tls_subscription.subscription will be updated in-place
  ~ resource "fastly_tls_subscription" "subscription" {
      ~ domains                 = [
          + "prod.hkakehas.tokyo",
            # (1 unchanged element hidden)
        ]
        id                      = "VGah8NFhdAq1z7rAO9B4jQ"
      ~ managed_dns_challenges  = [
          - {
              - record_name  = "_acme-challenge.stage.hkakehas.tokyo"
              - record_type  = "CNAME"
              - record_value = "tmmgyi0x887qmypzqv.fastly-validations.com"
            },
        ] -> (known after apply)
      ~ managed_http_challenges = [
          - {
              - record_name   = "stage.hkakehas.tokyo"
              - record_type   = "A"
              - record_values = [
                  - "151.101.131.52",
                  - "151.101.195.52",
                  - "151.101.3.52",
                  - "151.101.67.52",
                ]
            },
          - {
              - record_name   = "stage.hkakehas.tokyo"
              - record_type   = "CNAME"
              - record_values = [
                  - "t.sni.global.fastly.net",
                ]
            },
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ cert_info = {
      ~ domains         = [
          + "prod.hkakehas.tokyo",
            "stage.hkakehas.tokyo",
        ]
      ~ updated_at      = "2024-03-04T10:42:20Z" -> "2024-03-04T10:45:18Z"
        # (2 unchanged attributes hidden)
    }
  ~ dns_info  = {
      + "prod.hkakehas.tokyo"  = {
          + alias                            = []
          + allow_overwrite                  = true
          + cidr_routing_policy              = []
          + failover_routing_policy          = []
          + geolocation_routing_policy       = []
          + geoproximity_routing_policy      = []
          + health_check_id                  = null
          + latency_routing_policy           = []
          + multivalue_answer_routing_policy = null
          + name                             = "prod.hkakehas.tokyo"
          + records                          = [
              + "t.sni.global.fastly.net",
            ]
          + set_identifier                   = null
          + ttl                              = 300
          + type                             = "CNAME"
          + weighted_routing_policy          = []
          + zone_id                          = "Z032720523R36CX8M8EQU"
        }
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @hrmsk66, Action: `pull_request`, Working Directory: `cert/`, Workflow: `Deploy Cert`*